Revit 2027 API
AnalysisDisplayStyle.HasColoredSurfaceSettings Method
 If true style has colored surface settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasColoredSurfaceSettings()
Public Function HasColoredSurfaceSettings As Boolean
public:
bool HasColoredSurfaceSettings()
member HasColoredSurfaceSettings : unit -> bool
Return Value
Boolean
See Also
Reference
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace